nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/clock_config_MIMXRT1171.c
/*
 * Copyright 2018 - 2021 NXP
 *
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "bootloader/bl_context.h"
#include "bootloader_common.h"
#if BL_FEATURE_FLEXSPI_NOR_MODULE
#include "flexspi_nor_flash.h"
#endif
#include "fsl_device_registers.h"
#include "microseconds/microseconds.h"
#include "property/property.h"
#include "target_config.h"
#include "device_config.h"
#include "fusemap.h"
#if BL_FEATURE_OTFAD_MODULE
#include "ocotp/fsl_ocotp.h"
#endif
#include "utilities/fsl_assert.h"

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////
#define FREQ_1MHz (1000000UL)
#define FREQ_396MHz (396UL * FREQ_1MHz)
#define FREQ_528MHz (528UL * FREQ_1MHz)
#define FREQ_24MHz (24UL * FREQ_1MHz)
#define FREQ_200MHz (200UL * FREQ_1MHz)
#define FREQ_240MHz (240UL * FREQ_1MHz)
#define FREQ_480MHz (480UL * FREQ_1MHz)
#define FREQ_400MHz (400UL * FREQ_1MHz)
#define FREQ_500MHz (500UL * FREQ_1MHz)
#define FREQ_696MHz (696UL * FREQ_1MHz)
#define FREQ_19P2MHz (19200000u) // 19.2MHz
#define FREQ_360MHz (360UL * FREQ_1MHz)
#define FREQ_594MHz (594UL * FREQ_1MHz)
#define FREQ_664MHz (664UL * FREQ_1MHz)

enum
{
    kMaxFreq_M7 = 700 * FREQ_1MHz,
    kMaxFreq_M4 = 240 * FREQ_1MHz,
    kMaxFreq_Bus = 200 * FREQ_1MHz,
    kMaxFreq_BusL = 120 * FREQ_1MHz,
    kMaxFreq_UART = 80 * FREQ_1MHz,
    kMaxFreq_FLEXSPI = 332 * FREQ_1MHz,
    kMaxFreq_SEMC = 400 * FREQ_1MHz,
    kMaxFreq_USDHC = 400 * FREQ_1MHz,
    kMaxFreq_SPI = 135 * FREQ_1MHz,
    kMaxFreq_FLEXRAM = 175 * FREQ_1MHz,
};

enum
{
    kCm7ClockSrc_RC400M = 0xaa,
    kCm7ClockSrc_PLL_ARM = 0x3c,
};

enum
{
    kCm4ClockSrc_RC400M = 0xaa,
    kCm4ClockSrc_PLL_480 = 0x3c,
};

////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Prototypes
////////////////////////////////////////////////////////////////////////////////
extern bool is_cm4_boot(void);
void configure_m7_boot_clock(bootloader_clock_option_t option);
void configure_m4_boot_clock(bootloader_clock_option_t option);
void rc400m_trim(void);
void rc16m_trim(void);

uint32_t get_cm7_core_src(void);
uint32_t get_cm4_core_src(void);
uint32_t get_osc_freq(void);
status_t configure_plls(bool enableArmPll);
status_t configure_arm_pll(uint32_t oscFreq);
status_t configure_480_pll(uint32_t oscFreq);
status_t configure_528_pll(uint32_t oscFreq);
void configure_rc400m(void);
void sw_delay_us(uint32_t us);
void enable_pll_ldo_power(void);
extern uint32_t get_flexspinor_instance(void);
static inline uint32_t get_clock_div(uint32_t root, uint32_t maxFreq)
{
    return ((root + maxFreq - 1) / maxFreq);
}

void bypass_ldo_1p8(void);
void bypass_ldo_1p0(void);
void bypass_ldo_1p8_and_1p0(void);

////////////////////////////////////////////////////////////////////////////////
// Code
////////////////////////////////////////////////////////////////////////////////
void rc400m_trim(void)
{
    uint32_t trimRegValue = ANADIG_OSC->OSC_OTP_TRIM_VALUE_200M;

    uint32_t trimEnable = (trimRegValue & (1u << 9)) ? 1 : 0;
    uint32_t trimBypass = (trimRegValue & (1u << 8)) ? 1 : 0;
    uint32_t trimValue = trimRegValue & 0xFF;

    if (trimEnable)
    {
        debug_printf("rc400m_trim_reg_value=%x\n", trimRegValue);
        ANADIG_MISC->VDDLPSR_AI400M_CTRL = 0x20;
        ANADIG_MISC->VDDLPSR_AI400M_WDATA = (trimBypass << 10) | (trimValue << 24);
        ANADIG_MISC->VDDLPSR_AI400M_CTRL |= 0x100;
        sw_delay_us(1);
        ANADIG_MISC->VDDLPSR_AI400M_CTRL &= ~0x100;
    }
}

void rc16m_trim(void)
{
    /*
    1,power up.
    2,RC16M power up without trim.
    3,Enable osc24M with register bit (bit8 of OSC24M_CTRL) write 1'b1
    4,wait OSC_24M_stable(bit 30 of OSC24M_CTRL) wait 1'b1
    5,Switch source(24M) of 16M with register bit (bit8 of OSC4M16M_CTRL) write 1'b1
    6,Enable TRIM_SW_FORCE_16M register bit(bit 2 of ANATOP_CTRL)
    7,Check OSC_OTP_TRIM_VALUE_16M bit 29(osc_16m_trim_en) is 1'b1.If 1'b1, TRIM_VALUE is available in trim bus and able
    to use.
    8,Switch source(Trimmed 16M) of 16M with register bit (bit8 of OSC4M16M_CTRL) write 1'b0
    */

    volatile uint32_t trimOption = 3;

    debug_printf("%s(), started\n", __func__);

    if (FUSE_OSC_4_16M_TRIM_EN_VAL)
    {
        if (trimOption == 0)
        {
            // Step 3
            // Enable OSC, wait until OSC is stable
            ANADIG_OSC->OSC_24M_CTRL = 0x14; // OSC_EN=1, LP_EN=1, GATE=0, BYPASS=0
            while (!(ANADIG_OSC->OSC_24M_CTRL & (1u << 30)))
            {
            }
            ANADIG_OSC->OSC_4M16M_CTRL |= (1u << 8);
            ANADIG_OSC->ANATOP_CTRL |= (1u << 2);
            if (ANADIG_OSC->OSC_OTP_TRIM_VALUE_16M & (1u << 29))
            {
            }
            ANADIG_OSC->OSC_4M16M_CTRL &= ~(uint32_t)(1u << 8);
        }
        else if (trimOption == 1)
        {
            ANADIG_OSC->OSC_4M16M_CTRL |= (1u << 8);
            ANADIG_OSC->ANATOP_CTRL |= (1u << 2);
            if (ANADIG_OSC->OSC_OTP_TRIM_VALUE_16M & (1u << 29))
            {
            }
            ANADIG_OSC->OSC_4M16M_CTRL &= ~(uint32_t)(1u << 8);
        }
        else
        {
            // Do not trim
        }
    }

    debug_printf("%s(), completed\n", __func__);
}

void bypass_ldo_1p8(void)
{
// 1. Bypass LPSPR_LDO-1P8 first
// Enter bypass sequence
/*
Before bypassing the LPSR_LDO_1P8, ensure the bit "pull_down_2ma_en"=1, "track_mode_en"=0, "bypass_mode_en"=0,
"reg_disable" =0, "reg_lp_en"=0. Then do the following steps to enter the bypass.
1. Set the "bypass_mode_cfg[1:0]"=10, "bypass_current_cfg[1:0]"=10 and "track_mode_en"=1 to ensure the LPSR_LDO_1P8’s
output start to follow the DCDC’s.
2. Waiting at least 125us to ensure the LDO’s output can follow the DCDC’s completely.
3. Set the "bypass_mode_en" to high to bypass the LPSR_LDO_1P8.
4. Waiting at least 50us.
5. Set the "reg_disable" =1, then the LPSR_LDO_1P8 enter the bypass mode completely.
*/
#define PULL_DOWN_2MA_EN_MASK (1u << 3)
#define TRACK_MODE_EN_MASK (1u << 19)
#define BYPASS_MODE_EN_MASK (1u << 5)
#define REG_DISABLE_MASK (1u << 2)
#define REG_LP_EN_MASK (1u << 0)
#define BYPASS_MODE_CFG_SHIFT (11)
#define BYPASS_MODE_CFG_MASK (0x3u << BYPASS_MODE_CFG_SHIFT)
#define BYPASS_MODE_CFG(x) (((x) << BYPASS_MODE_CFG_SHIFT) & BYPASS_MODE_CFG_MASK)
#define BYPASS_PRECHRG_CURRENT_CFG_SHIFT (9)
#define BYPASS_PRECHRG_CURRENT_CFG_MASK (0x3u << BYPASS_PRECHRG_CURRENT_CFG_SHIFT)
#define BYPASS_PRECHRG_CURRENT_CFG(x) (((x) << BYPASS_PRECHRG_CURRENT_CFG_SHIFT) & BYPASS_PRECHRG_CURRENT_CFG_MASK)
#define PMU_LDO_LPSR_1P8 (*(uint32_t *)(ANADIG_MISC_BASE + 0x510))

