nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/clock_config_MIMXRT1171.c
    debug_printf("%s(), started\n", __func__);

    // Preparation
    uint32_t tmpRegVal = PMU_LDO_LPSR_1P8;
    tmpRegVal |= (PULL_DOWN_2MA_EN_MASK);
    tmpRegVal &= (uint32_t) ~(TRACK_MODE_EN_MASK | BYPASS_MODE_EN_MASK | REG_DISABLE_MASK | REG_LP_EN_MASK);
    PMU_LDO_LPSR_1P8 = tmpRegVal;
    __ISB();

    // Step 1
    tmpRegVal = PMU_LDO_LPSR_1P8;
    tmpRegVal = (tmpRegVal & ~(BYPASS_MODE_CFG_MASK | BYPASS_PRECHRG_CURRENT_CFG_MASK)) | BYPASS_MODE_CFG(2) |
                BYPASS_PRECHRG_CURRENT_CFG(2);
    tmpRegVal |= TRACK_MODE_EN_MASK;
    PMU_LDO_LPSR_1P8 = tmpRegVal;
    __ISB();

    // Step 2, delay more time in case the clock is not accurate
    sw_delay_us(200);

    // Step 3
    PMU_LDO_LPSR_1P8 |= BYPASS_MODE_EN_MASK;
    __ISB();
    // Step 4
    sw_delay_us(100);

    // Step 5
    PMU_LDO_LPSR_1P8 |= REG_DISABLE_MASK;
    __ISB();

    debug_printf("%s(), completed\n", __func__);
}

void bypass_ldo_1p0(void)
{
/*
Enter bypass
1) before enter bypass mode, please make sure DCDC is enabled and LPSR_LDO_1P0 is enabled.
reg_en=1, reg_hp_en=0, tracking_mode=0, bypass_mode=0
2) Let LPSR_LDO_1P0 enter high power mode. At least wait 200us before next step operation.
reg_en=1, reg_hp_en=0->1, tracking_mode=0, bypass_mode=0
3) Let LPSR_LDO_1P0 enter track mode. At least wait 300us before next step operation.
reg_en=1, reg_hp_en=1, tracking_mode=0->1, bypass_mode=0
4) Let LPSR_LDO_1P0 enter the mode that DCDC and ldo_1p0 supply power simultaneously. At least wait 25us before next
step operation. reg_en=1, reg_hp_en=1, tracking_mode=1, bypass_mode=0->1
5) Disable LPSR_LDO_1P0, only DCDC provide power supply. The procedure of enter bypass mode is completed.
   reg_en=1->0, reg_hp_en=1, tracking_mode=1, bypass_mode=1

*/
#define PULL_DOWN_2MA_EN_MASK (1u << 3)
#define TRACKING_MODE_MASK (1u << 17)
#define BYPASS_MODE_MASK (1u << 18)
#define REG_EN_MASK (1u << 2)
#define REG_HP_EN_MASK (1u << 0)
#define BYPASS_MODE_CFG_SHIFT (11)
#define BYPASS_MODE_CFG_MASK (0x3u << BYPASS_MODE_CFG_SHIFT)
#define BYPASS_MODE_CFG(x) (((x) << BYPASS_MODE_CFG_SHIFT) & BYPASS_MODE_CFG_MASK)
#define BYPASS_PRECHRG_CURRENT_CFG_SHIFT (9)
#define BYPASS_PRECHRG_CURRENT_CFG_MASK (0x3u << BYPASS_PRECHRG_CURRENT_CFG_SHIFT)
#define BYPASS_PRECHRG_CURRENT_CFG(x) (((x) << BYPASS_PRECHRG_CURRENT_CFG_SHIFT) & BYPASS_PRECHRG_CURRENT_CFG_MASK)
#define PMU_LDO_LPSR_1P0 (*(uint32_t *)(ANADIG_MISC_BASE + 0x530))

    debug_printf("%s(), started\n", __func__);

    // Step 1
    uint32_t tmpRegVal = PMU_LDO_LPSR_1P0;
    tmpRegVal |= REG_EN_MASK;
    tmpRegVal &= (uint32_t) ~(REG_HP_EN_MASK | TRACKING_MODE_MASK | BYPASS_MODE_MASK);
    PMU_LDO_LPSR_1P0 = tmpRegVal;
    __ISB();

    // Step 2
    PMU_LDO_LPSR_1P0 |= REG_HP_EN_MASK;
    __ISB();
    sw_delay_us(300);

    // Step 3
    PMU_LDO_LPSR_1P0 |= TRACKING_MODE_MASK;
    __ISB();
    sw_delay_us(400);

    // Step 4
    PMU_LDO_LPSR_1P0 |= BYPASS_MODE_MASK;
    __ISB();
    sw_delay_us(50);

    // Step 5
    PMU_LDO_LPSR_1P0 &= (uint32_t)~REG_EN_MASK;
    __ISB();

    debug_printf("%s(), completed\n", __func__);
}

void bypass_ldo_1p8_and_1p0(void)
{
    /* Sequence from design team:
    (1)When we plan to do the bypass operation for the LDO_1P0, it's required to do the bypass operation for the
    LDO_1P8 first, after that, we can start to do the bypass for the LDO_1P0.
    (2)When we plan to exit the bypass mode
    of the LDO_1P0, it's required the LDO_1P0 exit first, after that, we start to do the exit for the LDO_1P8.
    */
    bypass_ldo_1p8();
    bypass_ldo_1p0();
}

uint32_t get_osc_freq(void)
{
    uint32_t oscFreq = FREQ_24MHz;
    if (FUSE_BOOT_OSC_REF_VALUE)
    {
        oscFreq = FREQ_19P2MHz;
    }

    return oscFreq;
}

void sw_delay_us(uint32_t us)
{
    if (us > 0)
    {
        SysTick->LOAD = (SystemCoreClock / FREQ_1MHz) * us;
        SysTick->VAL = 0;
        SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;

        while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) != SysTick_CTRL_COUNTFLAG_Msk)
        {
        }
        SysTick->CTRL = 0;
        SysTick->VAL = 0;
    }
}

void configure_rc400m(void)
{
    debug_printf("%s: Start enabling RC400MHz\n", __func__);
    // Enable RC400M
    ANADIG_OSC->OSC_200M_CTRL1 &= ~0x01; // Enable RC400M
    ANADIG_OSC->OSC_200M_CTRL2 |= 0x01;  // Enable CLK

    rc400m_trim();
}

status_t configure_arm_pll(uint32_t oscFreq)
{
    debug_printf("%s\n", __func__);

    uint32_t divSelect = 0;
    // Enable ARM PLL
    if (oscFreq == FREQ_24MHz)
    {
        divSelect = 116; // ARM_PLL = 24MHz * 116 / 2 / 2= 696MHz
    }
    else if (oscFreq == FREQ_19P2MHz)
    {
        divSelect = 145; // ARM_PLL = 19.2MHz * 145 / 2 / 2 = 696MHz
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    // 1. Configure PLL register
    // 2. Power up PLL, assert holdring_off
    // 3. At half lock time, de-assert hondring off
    // 4. Wait PLL lock
    // 5. Enable clock out
    // Note: lock time: ARM_PLL 50us, PLL_480 50us, PLL_528 450us
    uint32_t regValue = ANADIG_PLL_PLL_ARM_CTRL_DIV_SELECT(divSelect) | ANADIG_PLL_PLL_ARM_CTRL_POWERUP(1) |
                        ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE(1);
    ANADIG_PLL->PLL_ARM_CTRL = regValue;
    __DSB();
    __ISB();
    sw_delay_us(30);
    //    regValue &= ~ANATOP_PLLARM_HOLD_RING_OFF(1);
    //    ANADIG_PLL->PLL_ARM_CTRL = regValue;
    uint32_t waitTicks = 0;
    uint32_t timeoutTicks = (SystemCoreClock / FREQ_1MHz) * 30;
    while ((ANADIG_PLL->PLL_ARM_CTRL & ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_STABLE_MASK) !=
           ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_STABLE_MASK)
    {
        waitTicks++;
        if (waitTicks > timeoutTicks)
        {
            debug_printf("ARM_PLL config timeout, ANADIG_PLL->PLL_ARM_CTRL=%x\n", ANADIG_PLL->PLL_ARM_CTRL);
            return kStatus_Timeout;
        }
    }

    // Delay 50us before enabling the clock out
    //    sw_delay_us(50);
    // Enable PLLARM Clock
    regValue |= ANADIG_PLL_PLL_ARM_CTRL_ENABLE_CLK(1);
    ANADIG_PLL->PLL_ARM_CTRL = regValue;

    // Enable Clock output
    regValue &= ~ANADIG_PLL_PLL_ARM_CTRL_PLL_ARM_GATE_MASK;
    ANADIG_PLL->PLL_ARM_CTRL = regValue;

