nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/clock_config_MIMXRT1171.c
    debug_printf("ARM_PLL config completed, ANADIG_PLL->PLL_ARM_CTRL=%x\n", ANADIG_PLL->PLL_ARM_CTRL);

    return kStatus_Success;
}

status_t configure_480_pll(uint32_t oscFreq)
{
    debug_printf("%s\n", __func__);

    uint32_t divSelect = 0;

    if (oscFreq == FREQ_24MHz)
    {
        divSelect = 3;
    }
    else if (oscFreq == FREQ_19P2MHz)
    {
        divSelect = 5;
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    // 1. Configure PLL register
    // 2. Enable interl LDO
    // 3. Wait LDO stable
    // 4. Power up PLL, assert holdring_off
    // 5. At half lock time, de-assert hondring off
    // 6. Wait PLL lock
    // 7. Enable clock out
    // Note: lock time: ARM_PLL 50us, PLL_480 50us, PLL_528 450us
    // Gate off all the PFDs first
    uint32_t pfdClockGateMask = ANADIG_PLL_PLL_480_PFD_PFD0_FRAC_MASK | ANADIG_PLL_PLL_480_PFD_PFD1_FRAC_MASK |
                                ANADIG_PLL_PLL_480_PFD_PFD2_FRAC_MASK | ANADIG_PLL_PLL_480_PFD_PFD3_FRAC_MASK;
    ANADIG_PLL->PLL_480_PFD |= pfdClockGateMask;
    // REG_EN=1, DIVSEL=3/5, GATE=1
    uint32_t regValue = ANADIG_PLL_PLL_480_CTRL_DIV_SELECT(divSelect) | ANADIG_PLL_PLL_480_CTRL_PLL_REG_EN(1) |
                        ANADIG_PLL_PLL_480_CTRL_PLL_480_GATE(1);
    ANADIG_PLL->PLL_480_CTRL = regValue;
    sw_delay_us(30); // Wait until the LDO is stable (controlled by REG_EN bit)
    // REG_EN=1, DIVSEL=3/5, GATE=1, POWERUP=1, HOLDRING_OFF=1
    regValue |= ANADIG_PLL_PLL_480_CTRL_POWERUP(1) | ANADIG_PLL_PLL_480_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_480_CTRL = regValue;
    sw_delay_us(30);
    // REG_EN=1, DIVSEL=3/5, GATE=1, POWERUP=1 HOLDRING_OFF=0
    regValue &= ~ANADIG_PLL_PLL_480_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_480_CTRL = regValue;
    uint32_t waitTicks = 0;
    uint32_t timeoutTicks = (SystemCoreClock / FREQ_1MHz) * 30;
    while ((ANADIG_PLL->PLL_480_CTRL & ANADIG_PLL_PLL_480_CTRL_PLL_480_STABLE_MASK) !=
           ANADIG_PLL_PLL_480_CTRL_PLL_480_STABLE_MASK)
    {
        waitTicks++;
        if (waitTicks > timeoutTicks)
        {
            debug_printf("480_PLL config timeout, ANADIG_PLL->PLL_480_CTRL=%x\n", ANADIG_PLL->PLL_480_CTRL);
            return kStatus_Timeout;
        }
    }

    // REG_EN=1, DIVSEL=3/5, GATE=1, POWERUP=1 HOLDRING_OFF=0 CLK=1, DIV2=1
    regValue |= ANADIG_PLL_PLL_480_CTRL_ENABLE_CLK(1) | ANADIG_PLL_PLL_480_CTRL_PLL_480_DIV2(1);
    ANADIG_PLL->PLL_480_CTRL = regValue;
    // REG_EN=1, DIVSEL=3/5, GATE=0, POWERUP=1 HOLDRING_OFF=0
    regValue &= ~ANADIG_PLL_PLL_480_CTRL_PLL_480_GATE_MASK;
    ANADIG_PLL->PLL_480_CTRL = regValue;

    debug_printf("480_PLL config completed, ANADIG_PLL->PLL_480_CTRL=%x\n", ANADIG_PLL->PLL_480_CTRL);

    // Enable PLL480_PFD, PFD0=13, PFD1=17, PFD2=32, PFD3=24
    // PFD0=664.6MHz, PFD1=508MHz, PFD2=270MHz, PFD3=360MHz
    ANADIG_PLL->PLL_480_PFD = ANADIG_PLL_PLL_480_PFD_PFD0_FRAC(13) | ANADIG_PLL_PLL_480_PFD_PFD1_FRAC(17) |
                              ANADIG_PLL_PLL_480_PFD_PFD2_FRAC(32) | ANADIG_PLL_PLL_480_PFD_PFD3_FRAC(24);
    debug_printf("ANADIG_PLL->PLL_480_PFD=%x\n", ANADIG_PLL->PLL_480_PFD);

    uint32_t stableMask =
        ANADIG_PLL->PLL_480_PFD & (ANADIG_PLL_PLL_480_PFD_PFD0_STABLE_MASK | ANADIG_PLL_PLL_480_PFD_PFD1_STABLE_MASK |
                                   ANADIG_PLL_PLL_480_PFD_PFD2_STABLE_MASK | ANADIG_PLL_PLL_480_PFD_PFD3_STABLE_MASK);

    /* Note:
     *      1. The PFD output will be updated automatically if the CLOCKGATE is turned on from the the gate-off state,
     *         No need to toggle the UPDATE bit.
     *      2. The stable signal will be ready quickly enough, so SW don't need to wait the stable signal, by the way,
     *         this signal will revert every time after the UPDATE completes
     */
    ANADIG_PLL->PLL_480_UPDATE ^= ANADIG_PLL_PLL_480_UPDATE_PFD0_UPDATE(1) | ANADIG_PLL_PLL_480_UPDATE_PFD1_UPDATE(1) |
                                  ANADIG_PLL_PLL_480_UPDATE_PFD2_UPDATE(1) | ANADIG_PLL_PLL_480_UPDATE_PFD3_UPDATE(1);

    // Wait until the stable bits get updated
    waitTicks = 0;
    timeoutTicks = (SystemCoreClock / FREQ_1MHz) * 30;
    while (ANADIG_PLL->PLL_480_PFD & stableMask)
    {
        waitTicks++;
        if (waitTicks > timeoutTicks)
        {
            debug_printf("480_PFD configuration timeout, ANADIG_PLL->PLL_480_PFD=%x\n", ANADIG_PLL->PLL_480_PFD);
            return kStatus_Timeout;
        }
    }

    return kStatus_Success;
}

status_t configure_528_pll(uint32_t oscFreq)
{
    debug_printf("%s\n", __func__);

    uint32_t mfn = 0;
    uint32_t mfi = 0;
    uint32_t mfd = 0xffffffffUL;
    if (oscFreq == FREQ_24MHz)
    {
        mfn = 0;
        mfi = 22;
    }
    else if (oscFreq == FREQ_19P2MHz)
    {
        mfn = 0x80000000UL;
        mfi = 27;
    }
    else
    {
        return kStatus_InvalidArgument;
    }
    // 1. Configure PLL register
    // 2. Enable interl LDO
    // 3. Wait LDO stable
    // 4. Power up PLL, assert holdring_off
    // 5. At half lock time, de-assert hondring off
    // 6. Wait PLL lock
    // 7. Enable clock out
    // Note: lock time: ARM_PLL 50us, PLL_480 50us, PLL_528 450us
    // Gate off all the PFDs first
    uint32_t pfdClockGateMask =
        ANADIG_PLL_PLL_528_PFD_PFD0_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD1_DIV1_CLKGATE(1) |
        ANADIG_PLL_PLL_528_PFD_PFD2_DIV1_CLKGATE(1) | ANADIG_PLL_PLL_528_PFD_PFD3_DIV1_CLKGATE(1);
    ANADIG_PLL->PLL_528_PFD |= pfdClockGateMask;

    // Freq = Fref * (MFI + MFN / MFD)
    ANADIG_PLL->PLL_528_MFD = mfd;
    ANADIG_PLL->PLL_528_MFN = mfn;
    ANADIG_PLL->PLL_528_MFI = mfi;

    // REG_EN=1, GATE=1 DIV_SEL = 0 POWERUP=0
    uint32_t regValue = ANADIG_PLL_PLL_528_CTRL_PLL_REG_EN(1) | ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE(1);
    ANADIG_PLL->PLL_528_CTRL = regValue;
    sw_delay_us(30); // Wait until the LDO is stable (controlled by the REG_EN)
                     // REG_EN=1, GATE=1 DIV_SEL = 0 POWERUP=1 HOLDRING_OFF=1
    regValue |= ANADIG_PLL_PLL_528_CTRL_POWERUP(1) | ANADIG_PLL_PLL_528_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_528_CTRL = regValue;
    sw_delay_us(250);
    // REG_EN=1, GATE=1 DIV_SEL = 0 POWERUP=1 HOLDRING_OFF = 0
    regValue &= ~ANADIG_PLL_PLL_528_CTRL_HOLD_RING_OFF_MASK;
    ANADIG_PLL->PLL_528_CTRL = regValue;
    uint32_t waitTicks = 0;
    uint32_t timeoutTicks = (SystemCoreClock / FREQ_1MHz) * 250;
    while ((ANADIG_PLL->PLL_528_CTRL & ANADIG_PLL_PLL_528_CTRL_PLL_528_STABLE_MASK) !=
           ANADIG_PLL_PLL_528_CTRL_PLL_528_STABLE_MASK)
    {
        waitTicks++;
        if (waitTicks > timeoutTicks)
        {
            debug_printf("528_PLL config timeout, ANADIG_PLL->PLL_528_CTRL=%x\n", ANADIG_PLL->PLL_528_CTRL);
            return kStatus_Timeout;
        }
    }

