nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/clock_config_MIMXRT1171.c
    // REG_EN=1, GATE=0 DIV_SEL = 0 POWERUP=1 HOLDRING_OFF=0 CLK=1
    regValue |= ANADIG_PLL_PLL_528_CTRL_ENABLE_CLK_MASK;
    // Enable PLL528 Clock
    ANADIG_PLL->PLL_528_CTRL = regValue;
    // REG_EN=1, GATE=0 DIV_SEL = 0 POWERUP=1 HOLDRING_OFF=0
    regValue &= ~ANADIG_PLL_PLL_528_CTRL_PLL_528_GATE_MASK;
    ANADIG_PLL->PLL_528_CTRL = regValue;
    debug_printf("528_PLL config completed, ANADIG_PLL->PLL_528_CTRL=%x\n", ANADIG_PLL->PLL_528_CTRL);

    // Enable PLL528_PFD PFD0=27, PFD1=16, PFD2=24, PFD3=32
    // PFD0=352MHz, PFD1=594MHz, PFD2=396MHz, PFD3=297MHz
    ANADIG_PLL->PLL_528_PFD = ANADIG_PLL_PLL_528_PFD_PFD0_FRAC(27) | ANADIG_PLL_PLL_528_PFD_PFD1_FRAC(16) |
                              ANADIG_PLL_PLL_528_PFD_PFD2_FRAC(24) | ANADIG_PLL_PLL_528_PFD_PFD3_FRAC(32);
    debug_printf("ANADIG_PLL->PLL_528_PFD=%x\n", ANADIG_PLL->PLL_528_PFD);
    /* Note:
     *      1. The PFD output will be updated automatically if the CLOCKGATE is turned on from the the gate-off state,
     *         No need to toggle the UPDATE bit.
     *      2. The stable signal will be ready quickly enough, so SW don't need to wait the stable signal, by the way,
     *        this signal will revert every time after the UPDATE completes
     */

    uint32_t stableMask =
        ANADIG_PLL->PLL_528_PFD & (ANADIG_PLL_PLL_528_PFD_PFD0_STABLE(1) | ANADIG_PLL_PLL_528_PFD_PFD1_STABLE(1) |
                                   ANADIG_PLL_PLL_528_PFD_PFD2_STABLE(1) | ANADIG_PLL_PLL_528_PFD_PFD3_STABLE(1));
    // Trigger PFD update
    ANADIG_PLL->PLL_528_UPDATE ^= (ANADIG_PLL_PLL_528_UPDATE_PFD0_UPDATE(1) | ANADIG_PLL_PLL_528_UPDATE_PFD1_UPDATE(1) |
                                   ANADIG_PLL_PLL_528_UPDATE_PFD2_UPDATE(1) | ANADIG_PLL_PLL_528_UPDATE_PFD3_UPDATE(1));

    // Wait until the stable bits get updated
    waitTicks = 0;
    timeoutTicks = (SystemCoreClock / FREQ_1MHz) * 250;
    while (ANADIG_PLL->PLL_528_PFD & stableMask)
    {
        waitTicks++;
        if (waitTicks > timeoutTicks)
        {
            debug_printf("528_PFD config timeout, ANADIG_PLL->PLL_528_PFD=%x\n", ANADIG_PLL->PLL_528_PFD);
            return kStatus_Timeout;
        }
    }

    return kStatus_Success;
}

status_t configure_plls(bool enableArmPll)
{
    status_t status = kStatus_Fail;
    // Enable OSC, wait until OSC is stable
    ANADIG_OSC->OSC_24M_CTRL = 0x14; // OSC_EN=1, LP_EN=1, GATE=0, BYPASS=0
    while (!(ANADIG_OSC->OSC_24M_CTRL & 0x40000000u))
    {
    }

    uint32_t oscFreq = get_osc_freq();

    if (enableArmPll)
    {
        status = configure_arm_pll(oscFreq);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

    enable_pll_ldo_power();

    // Enable PLL480 and its PFDs
    status = configure_480_pll(oscFreq);
    if (status != kStatus_Success)
    {
        return status;
    }

    // Enable PLL528 and its PFDs
    status = configure_528_pll(oscFreq);
    if (status != kStatus_Success)
    {
        return status;
    }

    return kStatus_Success;
}

uint32_t get_cm7_core_src(void)
{
    if (FUSE_BOOT_FREQ_VALUE)
    {
        return kCm7ClockSrc_PLL_ARM;
    }
    else
    {
        return kCm7ClockSrc_RC400M;
    }
}

uint32_t get_cm4_core_src(void)
{
    if (FUSE_BOOT_FREQ_VALUE)
    {
        return kCm4ClockSrc_PLL_480;
    }
    else
    {
        return kCm4ClockSrc_RC400M;
    }
}

void configure_m7_boot_clock(bootloader_clock_option_t option)
{
    uint32_t postDivider = 1 << (FUSE_LPB_BOOT_VALUE);
    if (postDivider > 8)
    {
        postDivider = 1;
    }

    if (option == kClockOption_EnterBootloader)
    {
        // Switch the critical clock roots to the safe clock root before doing any clock updates
        CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL = CCM_CONTROL_DIV(0) | CCM_CONTROL_MUX(0);
        CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM4].CONTROL = CCM_CONTROL_DIV(0) | CCM_CONTROL_MUX(0);
        // Configure Clock Divider, MUX
        CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUS].CONTROL = CCM_CONTROL_DIV(0) | CCM_CONTROL_MUX(0);
        CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUSL].CONTROL = CCM_CONTROL_DIV(0) | CCM_CONTROL_MUX(0);

        /*
            The M7 supports 2 typical clock frequencies:
                - 400MHz from RC400M
                - 800MHz from PLL_ARM with OSC24M/19.2M as reference clock
            To support 400MHz, ROM needs to perform RC400M TRIM routine first
         */
        // Always enable RC400M
        configure_rc400m();
        rc16m_trim();

        uint32_t coreSrc = get_cm7_core_src();
        if (coreSrc == kCm7ClockSrc_RC400M)
        {
            uint32_t clockToSwitch = FREQ_400MHz;

            uint32_t cm7ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M7) * postDivider;
            uint32_t cm4ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M4) * postDivider;
            uint32_t busClockDiv = get_clock_div(clockToSwitch, kMaxFreq_Bus) * postDivider;
            uint32_t lowpowerBusClock = get_clock_div(clockToSwitch, kMaxFreq_BusL) * postDivider;
            uint32_t flexramClkDiv = get_clock_div(clockToSwitch, kMaxFreq_FLEXRAM);

            // Configure FLEXRAM clock before switching to higher frequency
            CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].CONTROL =
                CCM_CLOCK_GROUP_CTRL_DIV0(flexramClkDiv - 1) | CCM_CLOCK_GROUP_CTRL_RSTDIV(flexramClkDiv - 1);

            // Wait until switch done
            while (CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].STATUS0 & 0x80000000u)
            {
            }

            // Configure Clock Source and divider, switch to RC400M
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL =
                CCM_CONTROL_DIV(cm7ClockDiv - 1) | CCM_CONTROL_MUX(2);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM4].CONTROL =
                CCM_CONTROL_DIV(cm4ClockDiv - 1) | CCM_CONTROL_MUX(2);
            // Configure Clock Divider, MUX
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUS].CONTROL =
                CCM_CONTROL_DIV(busClockDiv - 1) | CCM_CONTROL_MUX(2);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUSL].CONTROL =
                CCM_CONTROL_DIV(lowpowerBusClock - 1) | CCM_CONTROL_MUX(2);

            // Enable PLL for FlexSPI, SEMC and other IP use.
            status_t status = configure_plls(false);
            if (status != kStatus_Success)
            {
                // TODO: do something here
            }
#ifndef BL_TARGET_FPGA
            // Select LPUART clock frequency: From RC400M / 5 = 80MHz
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(4) | CCM_CONTROL_MUX(2);
#endif
            SystemCoreClock = clockToSwitch / cm7ClockDiv;
        }
        else if (coreSrc == kCm7ClockSrc_PLL_ARM)
        {
            uint32_t cm7ClockDiv = get_clock_div(FREQ_696MHz, kMaxFreq_M7) * postDivider;
            uint32_t cm4ClockDiv = get_clock_div(FREQ_400MHz, kMaxFreq_M4) * postDivider;
            uint32_t busClockDiv = get_clock_div(FREQ_480MHz, kMaxFreq_Bus) * postDivider;
            uint32_t lowpowerBusClock = get_clock_div(FREQ_360MHz, kMaxFreq_BusL) * postDivider;
            uint32_t flexramClkDiv = get_clock_div(FREQ_696MHz, kMaxFreq_FLEXRAM) * postDivider;

            // Configure FLEXRAM clock before switch to higher frequency
            CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].CONTROL =
                CCM_CLOCK_GROUP_CTRL_DIV0(flexramClkDiv - 1) | CCM_CLOCK_GROUP_CTRL_RSTDIV(flexramClkDiv - 1);
            // Wait until switch done
            while (CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].STATUS0 & 0x80000000u)
            {
            }

            // Enable PLL for FlexSPI, SEMC and other IP use.
            status_t status = configure_plls(true);
            if (status != kStatus_Success)
            {
                // TODO: do something here
            }

