nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/clock_config_MIMXRT1171.c
            // Swtich clock soruce to PLL
            // Configure Clock Divider and MUX
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL =
                CCM_CONTROL_DIV(cm7ClockDiv - 1) | CCM_CONTROL_MUX(4);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM4].CONTROL =
                CCM_CONTROL_DIV(cm4ClockDiv - 1) | CCM_CONTROL_MUX(2);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUS].CONTROL =
                CCM_CONTROL_DIV(busClockDiv - 1) | CCM_CONTROL_MUX(4);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUSL].CONTROL =
                CCM_CONTROL_DIV(lowpowerBusClock - 1) | CCM_CONTROL_MUX(4);

#ifndef BL_TARGET_FPGA
            // Select LPUART clock frequency - From PLL480_div / 3 = 240MHz / 3 = 80MHz
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(2) | CCM_CONTROL_MUX(4);
#endif

            SystemCoreClock = FREQ_696MHz;
        }

#if BL_FEATURE_FLEXSPI_NOR_MODULE
        // Set FlexSPI Boot clock source
//#warning sbl-tip3: Need to find out the failure cause of calling set_clock_source() api in sbl, note that it is ok in flashloader
        //flexspi_update_clock_source(get_flexspinor_instance(), kFlexSpiBootClkcSrc);
#endif

        debug_printf("Clock configuration done, SystemCoreClock = %dMHz\n", SystemCoreClock / FREQ_1MHz);
    }
    else if (option == kClockOption_ExitBootloader)
    {
    }
}

void configure_m4_boot_clock(bootloader_clock_option_t option)
{
    uint32_t postDivider = 1 << (FUSE_LPB_BOOT_VALUE);
    if (postDivider > 8)
    {
        postDivider = 1;
    }

    if (option == kClockOption_EnterBootloader)
    {
        /*
            The CM4 supports 1 typical clock frequency:
                - 200MHz from RC400M
            To support 200MHz, ROM needs to perform RC4800M TRIM routine first
         */
        configure_rc400m();
        rc16m_trim();

        // Bypass LD0 1P0 and 1P8 to achieve enough power
        bypass_ldo_1p8_and_1p0();

        uint32_t coreSrc = get_cm4_core_src();
        uint32_t clockToSwitch;
        uint32_t cm4ClockDiv;
        if (coreSrc == kCm4ClockSrc_RC400M)
        {
            uint32_t clockToSwitch = FREQ_400MHz;

            uint32_t cm7ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M7) * postDivider;
            uint32_t cm4ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M4) * postDivider;
            uint32_t busClockDiv = get_clock_div(clockToSwitch, kMaxFreq_Bus) * postDivider;
            uint32_t lowpowerBusClock = get_clock_div(clockToSwitch, kMaxFreq_BusL) * postDivider;
            uint32_t flexramClkDiv = get_clock_div(clockToSwitch, kMaxFreq_FLEXRAM) * postDivider;

            // Configure FLEXRAM clock before switching to higher frequency
            CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].CONTROL =
                CCM_CLOCK_GROUP_CTRL_DIV0(flexramClkDiv - 1) | CCM_CLOCK_GROUP_CTRL_RSTDIV(flexramClkDiv - 1);

            // Wait until switch done
            while (CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].STATUS0 & 0x80000000u)
            {
            }

            // Configure Clock Source and divider, switch to RC400M
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL =
                CCM_CONTROL_DIV(cm7ClockDiv - 1) | CCM_CONTROL_MUX(2);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM4].CONTROL =
                CCM_CONTROL_DIV(cm4ClockDiv - 1) | CCM_CONTROL_MUX(2);
            // Configure Clock Divider, MUX
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUS].CONTROL =
                CCM_CONTROL_DIV(busClockDiv - 1) | CCM_CONTROL_MUX(2);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUSL].CONTROL =
                CCM_CONTROL_DIV(lowpowerBusClock - 1) | CCM_CONTROL_MUX(2);

            // Enable PLL for FlexSPI, SEMC and other IP use.
            status_t status = configure_plls(false);
            if (status != kStatus_Success)
            {
                // TODO: do something here
            }

#ifndef BL_TARGET_FPGA
            // Select LPUART clock frequency: From RC400M / 5 = 80MHz
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(4) | CCM_CONTROL_MUX(2);
#endif

            SystemCoreClock = clockToSwitch / cm7ClockDiv;
        }
        else
        {
            clockToSwitch = FREQ_480MHz;

            uint32_t cm7ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M7) * postDivider;
            cm4ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M4) * postDivider;
            uint32_t busClockDiv = get_clock_div(clockToSwitch, kMaxFreq_Bus) * postDivider;
            uint32_t lowpowerBusClock = get_clock_div(clockToSwitch, kMaxFreq_BusL) * postDivider;
            uint32_t flexramClkDiv = get_clock_div(clockToSwitch, kMaxFreq_FLEXRAM) * postDivider;

            // Configure FLEXRAM clock before switching to higher frequency
            CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].CONTROL =
                CCM_CLOCK_GROUP_CTRL_DIV0(flexramClkDiv - 1) | CCM_CLOCK_GROUP_CTRL_RSTDIV(flexramClkDiv - 1);

            // Wait until switch done
            while (CCM->CLOCK_GROUP[kCCM_ClockGroup_Flexram].STATUS0 & 0x80000000u)
            {
            }

            // Enable PLL for FlexSPI, SEMC and other IP use.
            status_t status = configure_plls(false);
            if (status != kStatus_Success)
            {
                // This path should never be touched considering the use case of RT117x
            }

            // Configure Clock Source and divider, switch to Pll480 for CM7 and CM4 core
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL =
                CCM_CONTROL_DIV(cm7ClockDiv - 1) | CCM_CONTROL_MUX(6);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM4].CONTROL =
                CCM_CONTROL_DIV(cm4ClockDiv - 1) | CCM_CONTROL_MUX(5);
            // Configure Clock Divider, MUX
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUS].CONTROL =
                CCM_CONTROL_DIV(busClockDiv - 1) | CCM_CONTROL_MUX(4);
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUSL].CONTROL =
                CCM_CONTROL_DIV(lowpowerBusClock - 1) | CCM_CONTROL_MUX(5);
#ifndef BL_TARGET_FPGA
            // Select LPUART clock frequency: From PLL480_Div2 / 3 = 240MHz / 3 = 80MHz
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL =
                CCM_CONTROL_DIV(2) | CCM_CONTROL_MUX(4);
#endif
        }

#if BL_FEATURE_FLEXSPI_NOR_MODULE
        // Set FlexSPI Boot clock source
        //flexspi_update_clock_source(get_flexspinor_instance(), kFlexSpiBootClkcSrc);
#endif
    }
    else if (option == kClockOption_ExitBootloader)
    {
    }
}

void enable_pll_ldo_power(void)
{
    // Enable PLL LDO Power
    ANADIG_MISC->VDDSOC_AI_CTRL = 0;
    ANADIG_MISC->VDDSOC_AI_WDATA = 0x0105;
    ANADIG_PMU->PMU_LDO_PLL ^= 0x10000;
    sw_delay_us(100);
    ANADIG_MISC->VDDSOC_AI_CTRL = ANADIG_MISC_VDDSOC_AI_CTRL_VDDSOC_AIRWB_MASK;
    ANADIG_PMU->PMU_LDO_PLL ^= 0x10000;
    ANADIG_PMU->PMU_POWER_DETECT_CTRL = 0x100;
    sw_delay_us(1);
    ANADIG_PMU->PMU_REF_CTRL |= 0x10;
}

bool reuse_rom_clocks(void)
{
    if (!(CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL && CCM->CLOCK_ROOT[kCCM_ClockRootIndex_CM7].CONTROL))
    {
        return false;
    }

