nxp-mcuxpresso/sbl/target/evkmimxrt1170/board/mcu_isp/clock_config_MIMXRT1171.c
    uint32_t postDivider = 1 << (FUSE_LPB_BOOT_VALUE);
    if (postDivider > 8)
    {
        postDivider = 1;
    }

    if (is_cm4_boot())
    {
        uint32_t clockToSwitch;
        uint32_t cm4ClockDiv;
        if (get_cm4_core_src() == kCm4ClockSrc_RC400M)
        {
            clockToSwitch = FREQ_400MHz;
            cm4ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M4) * postDivider;
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(4) | CCM_CONTROL_MUX(2);
        }
        else
        {
            clockToSwitch = FREQ_480MHz;
            cm4ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M4) * postDivider;
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(2) | CCM_CONTROL_MUX(4);
        }
        SystemCoreClock = clockToSwitch / cm4ClockDiv;
    }
    else
    {
        if (get_cm7_core_src() == kCm7ClockSrc_RC400M)
        {
            uint32_t clockToSwitch = FREQ_400MHz;
            uint32_t cm7ClockDiv = get_clock_div(clockToSwitch, kMaxFreq_M7) * postDivider;
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(4) | CCM_CONTROL_MUX(2);
            SystemCoreClock = clockToSwitch / cm7ClockDiv;
        }
        else /* get_cm7_core_src() == kCm7ClockSrc_PLL_ARM */
        {
            CCM->CLOCK_ROOT[kCCM_ClockRootIndex_UART1].CONTROL = CCM_CONTROL_DIV(2) | CCM_CONTROL_MUX(4);
            if (FUSE_SPEED_LIMIT_VALUE == 1)
            {
                SystemCoreClock = FREQ_500MHz / postDivider;
            }
            else
            {
                SystemCoreClock = FREQ_696MHz / postDivider;
            }
        }
    }

    return true;
}

// See bootloader_common for documentation on this function.
void configure_clocks(bootloader_clock_option_t option)
{
    debug_printf("configure_clocks()\n");
#ifndef BL_TARGET_FPGA
    if (option == kClockOption_EnterBootloader)
    {
        SystemCoreClock = FREQ_24MHz; // Default core clock before initializing the boot clock
        if (reuse_rom_clocks())
        {
            return;
        }
    }
    debug_printf("SystemCoreClock=%dMHz\n", SystemCoreClock / 1000000);

    if (is_cm4_boot())
    {
        configure_m4_boot_clock(option);
    }
    else
    {
        configure_m7_boot_clock(option);
    }
#else
    SystemCoreClock = 24000000u;
    debug_printf("SystemCoreClock=%dMHz\n", SystemCoreClock / 1000000);
#endif
}

#define USBPHY_PLL_DIV_SEL_20 3
#define USBPHY_PLL_DIV_SEL_25 5
bool usb_clock_init(uint32_t controllerId)
{
    debug_printf("Bootloader: usb_clock_init()---- Start.\n");

    USB1->USBCMD |= USBHS_USBCMD_RST_MASK;

    // Clear PHY from reset
    USBPHY1->CTRL_CLR = USBPHY_CTRL_SFTRST_MASK;
    // clear UTMI CLKGATE
    USBPHY1->CTRL &= ~USBPHY_CTRL_CLKGATE_MASK;
    USBPHY1->CTRL |= USBPHY_CTRL_ENUTMILEVEL2_MASK | USBPHY_CTRL_ENUTMILEVEL3_MASK;

    USBPHY1->CTRL |= USBPHY_CTRL_ENAUTOCLR_CLKGATE_MASK | USBPHY_CTRL_ENAUTOCLR_PHY_PWD_MASK;

    // Enable regulator
    USBPHY1->PLL_SIC |= USBPHY_PLL_SIC_PLL_REG_ENABLE_MASK;

    // FUSE_BOOT_OSC_REF_VALUE = 1'b0, 24 MHz input clock with default divid by 20
    // FUSE_BOOT_OSC_REF_VALUE = 1'b1, 19.2 MHz input clock with default divid by 25
    uint32_t pllSicVal = (USBPHY1->PLL_SIC & ~USBPHY_PLL_SIC_PLL_DIV_SEL_MASK);
    if (get_osc_freq() == FREQ_24MHz)
    {
        pllSicVal |= USBPHY_PLL_SIC_PLL_DIV_SEL(USBPHY_PLL_DIV_SEL_20);
    }
    else
    {
        pllSicVal |= USBPHY_PLL_SIC_PLL_DIV_SEL(USBPHY_PLL_DIV_SEL_25);
    }
    USBPHY1->PLL_SIC = pllSicVal;
    debug_printf("USBPHY1->PLL_SIC = %x\n", USBPHY1->PLL_SIC);

    // Enable the power
    USBPHY1->PLL_SIC |= USBPHY_PLL_SIC_PLL_POWER_MASK | USBPHY_PLL_SIC_PLL_ENABLE_MASK;
    // Wait for PLL lock
    microseconds_delay(100);

    // Enable usb clocks
    USBPHY1->PLL_SIC |= USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK;
    // Clear bypass bit
    USBPHY1->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_BYPASS_MASK;

    // clear UTMI CLKGATE, to run the clocks
    USBPHY1->CTRL &= ~USBPHY_CTRL_CLKGATE_MASK;
    // Set to normal mode
    USBPHY1->PWD = 0;
    debug_printf("Bootloader: usb_clock_init()---- End.\n");

    USB1->USBCMD &= (uint32_t)~USBHS_USBCMD_RS_MASK;

    return true;
}

// Get OCOTP clock
uint32_t get_ocotp_clock(void)
{
//#warning need to implement later
    return 0;
}

uint32_t get_bus_clock(void)
{
#ifndef BL_TARGET_FPGA
    // PIT is from BUS clock, the maximum bus clock is 200MHz
    uint32_t clkRoot = CCM->CLOCK_ROOT[kCCM_ClockRootIndex_BUS].CONTROL;
    uint32_t div = (clkRoot & CCM_CLOCK_ROOT_CONTROL_DIV_MASK) >> CCM_CLOCK_ROOT_CONTROL_DIV_SHIFT;
    uint32_t mux = (clkRoot & CCM_CLOCK_ROOT_CONTROL_MUX_MASK) >> CCM_CLOCK_ROOT_CONTROL_MUX_SHIFT;
    uint32_t busFreq = 0;

    switch (mux)
    {
        default:
        case 0:
            busFreq = FREQ_1MHz * 24u;
            break;
        case 1:
            busFreq = FREQ_1MHz * 24u;
            break;
        case 2:
            busFreq = FREQ_1MHz * 400u;
            break;
        case 3:
            busFreq = FREQ_1MHz * 16u;
            break;
        case 4:
            busFreq = FREQ_1MHz * 480u;
            break;
        case 5:
            busFreq = FREQ_1MHz * 200u;
            break;
        case 6:
            busFreq = FREQ_1MHz * 528u;
            break;
        case 7:
            busFreq = FREQ_1MHz * 297u;
            break;
    }
    return busFreq / (div + 1);
#else
    return 12000000u;
#endif
}

//! @brief Gets the clock value used for microseconds driver
uint32_t microseconds_get_clock(void)
{
    return get_bus_clock();
}

//! @brief Return uart clock frequency according to instance
uint32_t get_uart_clock(uint32_t instance)
{
    // LPUART1 clock has been configured to 80MHz in clock_configure
    uint32_t lpuart_clock = 0;

#if !defined(BL_TARGET_FPGA)
    lpuart_clock = 80 * FREQ_1MHz; // 80MHz;
#else
    lpuart_clock = 12 * FREQ_1MHz; // 12MHz;
#endif //  #if !defined (BL_TARGET_ZEBU) && !defined (BL_TARGET_FPGA)

    return lpuart_clock;
}




////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
